package javacore;

public class ClassDemo {
    public ClassDemo() {
        //类是构造对象的模板或蓝图
        // 像是切割饼干的磨具，而对象则是小饼干
        // 由类构造对象 的过程称为 创建类的实例
        // 对象中的数据称为 实例域
        // 实例域值的集合称为对象的当前状态
        // 封装给对象赋予了“黑盒”的特征

        // 每个对象都有唯一的身份 即对象标识
        // 对象三个主要特性 行为 状态 标识
        // 对象的状态影响它的行为

        // 首先从设计 类 开始， 然后再往每个类中 添加方法
        // 找名词与动词 原则，重要的词是类

        //        类之间常见的关系：依赖 use-a 一个类的方法操纵另一个类的对象
        //        应该让相互依赖的类减至最少 术语 为减小耦合度
        //        聚合  类A的对象包含类B的对象 has-a 继承
        // 继承 is-a 表示特殊与一般的关系

    }
}
